-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2020-11-27 03:47:01
-- 伺服器版本： 10.4.14-MariaDB
-- PHP 版本： 7.3.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `team_yoga`
--

-- --------------------------------------------------------

--
-- 資料表結構 `admins`
--

CREATE TABLE `admins` (
  `sid` int(11) NOT NULL,
  `loginEmail` varchar(255) NOT NULL,
  `loginPassword` varchar(255) NOT NULL,
  `nickname` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `admins`
--

INSERT INTO `admins` (`sid`, `loginEmail`, `loginPassword`, `nickname`) VALUES
(1, 'sally', '40bd001563085fc35165329ea1ff5c5ecbdbbeef', 'sal');

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `sid` int(11) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `list_id` varchar(30) NOT NULL,
  `product_num` varchar(10) NOT NULL,
  `publish_date` date NOT NULL,
  `price` int(11) NOT NULL,
  `on_sale` tinyint(11) NOT NULL DEFAULT 1,
  `quick_view_01` text NOT NULL,
  `quick_view_02` text NOT NULL,
  `quick_view_03` text NOT NULL,
  `introduction` text NOT NULL,
  `color` varchar(50) NOT NULL,
  `length` int(11) NOT NULL,
  `width` int(11) NOT NULL,
  `thickness` int(11) NOT NULL,
  `weight` varchar(11) NOT NULL,
  `img` text NOT NULL DEFAULT '[]'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`sid`, `product_name`, `list_id`, `product_num`, `publish_date`, `price`, `on_sale`, `quick_view_01`, `quick_view_02`, `quick_view_03`, `introduction`, `color`, `length`, `width`, `thickness`, `weight`, `img`) VALUES
(1, '36 pro® 6mm', 'mat01-purple', 'm01-p-180', '2020-10-01', 3600, 0, '1. 全新結構，提供手腕與腳踝最佳緩衝及保護。', '2. 天然橡膠材質，乾濕止滑效果優異。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '超密寬敞的高性能瑜伽墊，具有無與倫比的舒適性和緩衝性。保證PRO®永不磨損。', 'purple', 180, 66, 1, '340', 'm01_0,m01_1,m01_2,m01_3'),
(2, '36 pro® 6mm', 'mat01-green', 'm02-g-180', '2020-10-02', 3600, 0, '1. 全新結構，提供手腕與腳踝最佳緩衝及保護。', '2. 天然橡膠材質，乾濕止滑效果優異。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '超密寬敞的高性能瑜伽墊，具有無與倫比的舒適性和緩衝性。保證PRO®永不磨損。', 'green', 180, 66, 1, '340', 'm02_0,m02_1,m02_2,m02_3'),
(3, '36 pro® 6mm', 'mat01-dark_blue', 'm03-d-180', '2020-10-03', 3600, 0, '1. 全新結構，提供手腕與腳踝最佳緩衝及保護。', '2. 天然橡膠材質，乾濕止滑效果優異。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '超密寬敞的高性能瑜伽墊，具有無與倫比的舒適性和緩衝性。保證PRO®永不磨損。', 'dark_blue', 180, 66, 1, '340', 'm03_0,m03_1,m03_2,m03_3'),
(4, '36 pro® 6mm', 'mat01-purple', 'm01-p-180', '2020-10-01', 3600, 0, '1. 全新結構，提供手腕與腳踝最佳緩衝及保護。', '2. 天然橡膠材質，乾濕止滑效果優異。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '超密寬敞的高性能瑜伽墊，具有無與倫比的舒適性和緩衝性。保證PRO®永不磨損。', 'purple', 215, 66, 1, '360', 'm01_0,m01_1,m01_2,m01_3'),
(5, '36 pro® 6mm', 'mat01-green', 'm02-g-180', '2020-10-02', 3600, 0, '1. 全新結構，提供手腕與腳踝最佳緩衝及保護。', '2. 天然橡膠材質，乾濕止滑效果優異。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '超密寬敞的高性能瑜伽墊，具有無與倫比的舒適性和緩衝性。保證PRO®永不磨損。', 'green', 215, 66, 1, '360', 'm02_0,m02_1,m02_2,m02_3'),
(6, '36 pro® 6mm', 'mat01-dark_blue', 'm03-d-180', '2020-10-03', 3600, 0, '1. 全新結構，提供手腕與腳踝最佳緩衝及保護。', '2. 天然橡膠材質，乾濕止滑效果優異。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '超密寬敞的高性能瑜伽墊，具有無與倫比的舒適性和緩衝性。保證PRO®永不磨損。', 'dark_blue', 215, 66, 1, '360', 'm03_0,m03_1,m03_2,m03_3'),
(7, 'lite®4.7mm', 'mat02-red', 'm04-r-180', '2010-10-04', 2760, 0, '1. 高密度墊層可在任何表面提供無與倫比的體驗，關節保護和多功能性。', '2. 織物狀的表面光潔度可在姿勢之間實現最佳移動。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '中型瑜伽墊，為您的練習帶來無與倫比的緩沖和舒適感。', 'red', 180, 60, 0, '180', 'm04_0,m04_1,m04_2,m04_3'),
(8, 'lite®4.7mm', 'mat02-blue', 'm05-b-180', '2020-10-05', 2760, 0, '1. 高密度墊層可在任何表面提供無與倫比的體驗，關節保護和多功能性。', '2. 織物狀的表面光潔度可在姿勢之間實現最佳移動。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '中型瑜伽墊，為您的練習帶來無與倫比的緩沖和舒適感。', 'blue', 180, 60, 0, '180', 'm05_0,m05_1,m05_2,m05_3'),
(9, 'lite®4.7mm', 'mat02-black_blue', 'm06-b-180', '2020-10-06', 2760, 0, '1. 高密度墊層可在任何表面提供無與倫比的體驗，關節保護和多功能性。', '2. 織物狀的表面光潔度可在姿勢之間實現最佳移動。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '中型瑜伽墊，為您的練習帶來無與倫比的緩沖和舒適感。', 'black_blue', 180, 60, 0, '180', 'm06_0,m06_1,m06_2,m06_3'),
(10, 'lite®4.7mm', 'mat02-red', 'm04-r-180', '2010-10-04', 2760, 0, '1. 高密度墊層可在任何表面提供無與倫比的體驗，關節保護和多功能性。', '2. 織物狀的表面光潔度可在姿勢之間實現最佳移動。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '中型瑜伽墊，為您的練習帶來無與倫比的緩沖和舒適感。', 'red', 215, 60, 0, '200', 'm04_0,m04_1,m04_2,m04_3'),
(11, 'lite®4.7mm', 'mat02-blue', 'm05-b-180', '2020-10-05', 2760, 0, '1. 高密度墊層可在任何表面提供無與倫比的體驗，關節保護和多功能性。', '2. 織物狀的表面光潔度可在姿勢之間實現最佳移動。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '中型瑜伽墊，為您的練習帶來無與倫比的緩沖和舒適感。', 'blue', 215, 60, 0, '200', 'm05_0,m05_1,m05_2,m05_3'),
(12, 'lite®4.7mm', 'mat02-black_blue', 'm06-b-180', '2020-10-06', 2760, 0, '1. 高密度墊層可在任何表面提供無與倫比的體驗，關節保護和多功能性。', '2. 織物狀的表面光潔度可在姿勢之間實現最佳移動。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '中型瑜伽墊，為您的練習帶來無與倫比的緩沖和舒適感。', 'black_blue', 215, 60, 0, '200', 'm06_0,m06_1,m06_2,m06_3'),
(13, '環保瑜珈磚', 'b01', 'b01-b-023', '2020-10-01', 480, 0, '1. 高密度墊層可在任何表面提供無與倫比的體驗，關節保護和多功能性。', '2. 織物狀的表面光潔度可在姿勢之間實現最佳移動。', '3. 表面特殊波紋壓痕處理，提升質感並增加磨擦阻力係數。', '第一款由超過50％的再生EVA組成，輕巧的瑜珈磚可提供無與倫比的舒適性和支撐。', 'black', 23, 15, 10, '400', 'b01_0,b01_1,b01_2,b01_3'),
(14, '環保瑜珈磚', 'b02', 'b02-g-023', '2020-10-01', 480, 0, '1. 半徑邊緣帶來舒適感和美感。', '2. 高密度，極高的耐用性，牢固的支撐。', '3. 柔軟舒適的抓地力且防滑。', '第一款由超過51％的再生EVA組成，輕巧的瑜珈磚可提供無與倫比的舒適性和支撐。', 'grey', 23, 15, 10, '400', 'b02_0,b02_1,b02_2,b02_3'),
(15, '軟木瑜珈磚', 'b03', 'b03-b-022', '2020-09-02', 880, 0, '1. 輕便，重量小於市售常用粗粒軟木材質。', '2. 易於抓握的紋理表面。', '3. 舒適的輪廓邊緣。', '這款高品質瑜珈磚由可持續性的軟木塞製成，具堅固性且支撐效果極佳。', 'brown', 23, 15, 10, '250', 'b03_0,b03_1,b03_2,b03_3'),
(16, '薄軟木瑜珈磚', 'b04', 'b04-b-007', '2020-09-03', 780, 0, '1. 圓潤流暢四邊圓角設計。', '2. 表面材質更容易持握，提供練習時的安全支撐。', '3. 軟木來自櫟樹的樹皮，為可再生材質。', '此款軟木磚比其他尺寸的瑜珈磚薄，但同樣具有支撐作用。較薄的寬度便於握持並易於旅行攜帶。', 'brown', 8, 10, 22, '130', 'b04_0,b04_1,b04_2,b04_3'),
(17, '環保瑜珈磚 50D', 'b05', 'b05-b-010', '2020-09-04', 648, 0, '1. 使用有別於一般瑜珈磚發泡EVA材質，選擇對環境更友善方式製造。', '2. 使用環保再生材質', '3. 舒適的輪廓邊緣。', '輕量方便攜帶，同時兼顧舒適性與設計感。防滑邊緣與四邊倒角設計，使用時更加美觀與順手，具有優異的支撐性與耐用度。', 'black', 10, 15, 23, '270', 'b05_0,b05_1,b05_2,b05_3'),
(18, '瑜珈支撐墊', 'p01', 'p01-b-033', '2020-10-01', 179, 0, '1. 觸感柔軟，溫柔呵護膝蓋和手腕，舒適練習。', '2. 有效分解關節壓力，體式保持更長久。', '3. 保護手腕手腕，減小手腕負重。', '20mm加厚柔軟，保護脆弱關節。優良回彈，有效緩衝瑜珈體式帶來的關節壓力。', 'blue', 34, 17, 1, '800', 'p01_0,p01_1,p01_2,p01_3'),
(19, '瑜珈支撐墊', 'p02', 'b02-b-033', '2020-10-02', 179, 0, '1. 觸感柔軟，溫柔呵護膝蓋和手腕，舒適練習。', '2. 有效分解關節壓力，體式保持更長久。', '3. 保護手腕手腕，減小手腕負重。', '20mm加厚柔軟，保護脆弱關節。優良回彈，有效緩衝瑜珈體式帶來的關節壓力。', 'black', 34, 17, 1, '800', 'p02_0,p02_1,p02_2,p02_3'),
(20, 'Relex 顆粒按摩滾筒', 'rolle-pink', 'r01-p-045', '2020-09-07', 1288, 0, '1. 加厚發泡組織，舒適貼合各曲線幅度，適於調整與訓練。', '2. 於緊繃處做重點停留，放鬆疲憊累積的肌膜，軟化緊繃的肌肉線條。', '3. 建議搭配專業知識適度使用，請避免直接使用於身體關節交接處。', '無毒EVA材質，與肌膚接觸無負擔，高密度，高強度，不易變形，特殊紋路設計，按摩舒壓放鬆效果。', 'pink', 45, 0, 9, '140', 'r01_0,r01_1,r01_2,r01_3'),
(21, 'Relex 顆粒按摩滾筒', 'rolle-green', 'r02-g-045', '2020-09-07', 1288, 0, '1. 加厚發泡組織，舒適貼合各曲線幅度，適於調整與訓練。', '2. 於緊繃處做重點停留，放鬆疲憊累積的肌膜，軟化緊繃的肌肉線條。', '3. 建議搭配專業知識適度使用，請避免直接使用於身體關節交接處。', '無毒EVA材質，與肌膚接觸無負擔，高密度，高強度，不易變形，特殊紋路設計，按摩舒壓放鬆效果。', 'green', 45, 0, 9, '140', 'r02_0,r02_1,r02_2,r02_3'),
(22, 'Relex 顆粒按摩滾筒', 'rolle-cream', 'r03-c-045', '2020-09-07', 1288, 0, '1. 加厚發泡組織，舒適貼合各曲線幅度，適於調整與訓練。', '2. 於緊繃處做重點停留，放鬆疲憊累積的肌膜，軟化緊繃的肌肉線條。', '3. 建議搭配專業知識適度使用，請避免直接使用於身體關節交接處。', '無毒EVA材質，與肌膚接觸無負擔，高密度，高強度，不易變形，特殊紋路設計，按摩舒壓放鬆效果。', 'cream', 45, 0, 9, '140', 'r03_0,r03_1,r03_2,r03_3'),
(23, '重量運動手環', 'sand-blue', 's01-b-027', '2020-10-11', 2280, 0, '1. 一磅的重量，為鍛煉增加穩定且舒適的阻力。', '2. 採用最優質的健身材料製成，有多種顏色可供選擇', '3. 揮別醜陋又不便的傳統負重沙包，啟動新式美麗運動能量。', '瘦身效果遠遠超越啞鈴、負重沙包的運動神器，直接配戴在手腕、腳踝上，不影響日常生活，也能隨時隨地消耗熱量。', 'blue', 27, 7, 0, '100', 's01_0,s01_1,s01_2,s01_3'),
(24, '重量運動手環', 'sand-black', 's02-b-027', '2020-10-12', 2280, 0, '1. 一磅的重量，為鍛煉增加穩定且舒適的阻力。', '2. 採用最優質的健身材料製成，有多種顏色可供選擇', '3. 揮別醜陋又不便的傳統負重沙包，啟動新式美麗運動能量。', '瘦身效果遠遠超越啞鈴、負重沙包的運動神器，直接配戴在手腕、腳踝上，不影響日常生活，也能隨時隨地消耗熱量。', 'black', 27, 7, 0, '100', 's02_0,s02_1,s02_2,s02_3'),
(25, '重量運動手環', 'sand-white', 's03-w-027', '2020-10-13', 2280, 0, '1. 一磅的重量，為鍛煉增加穩定且舒適的阻力。', '2. 採用最優質的健身材料製成，有多種顏色可供選擇', '3. 揮別醜陋又不便的傳統負重沙包，啟動新式美麗運動能量。', '瘦身效果遠遠超越啞鈴、負重沙包的運動神器，直接配戴在手腕、腳踝上，不影響日常生活，也能隨時隨地消耗熱量。', 'white', 27, 7, 0, '100', 's03_0,s03_1,s03_2,s03_3'),
(26, '重量運動手環', 'sand-green', 's04-g-027', '2020-10-14', 2280, 0, '1. 一磅的重量，為鍛煉增加穩定且舒適的阻力。', '2. 採用最優質的健身材料製成，有多種顏色可供選擇', '3. 揮別醜陋又不便的傳統負重沙包，啟動新式美麗運動能量。', '瘦身效果遠遠超越啞鈴、負重沙包的運動神器，直接配戴在手腕、腳踝上，不影響日常生活，也能隨時隨地消耗熱量。', 'green', 27, 7, 0, '100', 's04_0,s04_1,s04_2,s04_3'),
(27, 'Thunder伸展帶', 'a01', 'a01-b-244', '2020-10-11', 550, 0, '1. 經過改良的中桿設計可牢固地固定瑜珈繩\n', '2. 提供安全、防滑的支撐。\n', '3. 由堅固、耐用、未漂白的棉織帶與染料製做，輕巧又環保。', '瑜伽伸展帶有助於掌握挑戰性的姿勢和平衡技巧。致力於將最高水平的功能性，美觀性和質量。', 'blue', 244, 4, 0, '200', 'a01_0,a01_1,a01_2,a01_3'),
(28, 'Thunder伸展帶', 'a02', 'a02-b-244', '2020-10-12', 550, 0, '1. 經過改良的中桿設計可牢固地固定瑜珈繩\n', '2. 提供安全、防滑的支撐。\n', '3. 由堅固、耐用、未漂白的棉織帶與染料製做，輕巧又環保。', '瑜伽伸展帶有助於掌握挑戰性的姿勢和平衡技巧。致力於將最高水平的功能性，美觀性和質量。', 'black', 244, 4, 0, '200', 'a02_0,a02_1,a02_2,a02_3'),
(29, 'Thunder伸展帶', 'a03', 'a03-p-244', '2020-10-13', 550, 0, '1. 經過改良的中桿設計可牢固地固定瑜珈繩\n', '2. 提供安全、防滑的支撐。\n', '3. 由堅固、耐用、未漂白的棉織帶與染料製做，輕巧又環保。', '瑜伽伸展帶有助於掌握挑戰性的姿勢和平衡技巧。致力於將最高水平的功能性，美觀性和質量。', 'purple', 244, 4, 0, '200', 'a03_0,a03_1,a03_2,a03_3'),
(30, 'Thunder伸展帶', 'a04', 'a04-p-244', '2020-10-14', 550, 0, '1. 經過改良的中桿設計可牢固地固定瑜珈繩\n', '2. 提供安全、防滑的支撐。\n', '3. 由堅固、耐用、未漂白的棉織帶與染料製做，輕巧又環保。', '瑜伽伸展帶有助於掌握挑戰性的姿勢和平衡技巧。致力於將最高水平的功能性，美觀性和質量。', 'pink', 244, 4, 0, '200', 'a04_0,a04_1,a04_2,a04_3'),
(31, '36 彈力帶', 'c01', 'c01--060', '2020-10-11', 664, 0, '1. 四種分級阻力搭配，由易至難，漸進式訓練。', '2. 獨創內裡菱格壓紋設計，高效防滑並增添3倍極限拉伸範圍。', '3. 環保、天然乳膠成分，讓手感柔軟，自然無味、彈力更強。', '100％天然乳膠彈力帶，可為您的鍛煉增加額外的挑戰。 所有套裝都放入網狀小袋中，便於存放。', '', 60, 5, 1, '100', 'c01_0,c01_1,c01_2,c01_3'),
(32, '36 彈力帶', 'c02', 'c02--060', '2020-10-12', 664, 0, '1. 四種分級阻力搭配，由易至難，漸進式訓練。', '2. 獨創內裡菱格壓紋設計，高效防滑並增添3倍極限拉伸範圍。', '3. 環保、天然乳膠成分，讓手感柔軟，自然無味、彈力更強。', '100％天然乳膠彈力帶，可為您的鍛煉增加額外的挑戰。 所有套裝都放入網狀小袋中，便於存放。', '', 60, 5, 1, '100', 'c02_0,c02_1,c02_2,c02_3'),
(33, '棉質舖巾', 'w01', 'w01--173', '2020-08-05', 1140, 0, '1. 採用高優質的超細纖維質料，親膚性佳且柔軟舒適。', '2. 專利Skidless®止滑技術，矽膠顆粒點服貼在瑜珈墊上，練習過程中不易滑動。', '3. 使用前可先噴上一些水氣，增加瑜珈鋪巾的止滑效果。', '瑜珈鋪巾適合熱瑜珈或是動態瑜珈使用，可直接平鋪在一般瑜珈墊上，在手腳濕潤情況下最能見到止滑效果。', '', 173, 61, 0, '120', 'w01_0,w01_1,w01_2,w01_3'),
(34, '環保羊毛舖巾', 'w02', 'w02--208', '2020-08-06', 1320, 0, '1. 75％的再生羊毛和25％的再生合成纖維。', '2. 鎖邊針跡，防止磨損。', '3. 密集編織具有抗拉伸性和超柔軟性，即使洗滌後仍能抵抗“起毛球”。', '由100％的再生纖維製成，可壓和折疊，提供溫暖，舒適和多功能性。', '', 208, 153, 0, '150', 'w02_0,w02_1,w02_2,w02_3');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `admins`
--
ALTER TABLE `admins`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=302;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
